In [1]:
import pandas as pd

In [2]:
obj = pd.Series([4, 7, -5, 3], index=['a', 'b', 'c', 'd'])
obj

a    4
b    7
c   -5
d    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [5]:
obj.dtype

dtype('int64')

In [6]:
s = pd.Series([9904312, 3448737, 2890451, 2466052], index=['서울', '부산', '인천', '대구'])

In [7]:
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [8]:
s.name = "인구"
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [9]:
s.index.name = '도시'
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [10]:
s['서울']

9904312

In [11]:
s[(s >= 2500000) & (s <= 5000000)]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [12]:
data = {'서울' : 9804312, '부산' : 3418737, '인천' : 2690451, '대전' : 1466052}

In [13]:
s2 = pd.Series(data)
s2

서울    9804312
부산    3418737
인천    2690451
대전    1466052
dtype: int64

In [14]:
ds = s - s2
ds

대구         NaN
대전         NaN
부산     30000.0
서울    100000.0
인천    200000.0
dtype: float64

In [15]:
ds[ds.notnull()]

부산     30000.0
서울    100000.0
인천    200000.0
dtype: float64

In [16]:
ds[ds.isnull()]

대구   NaN
대전   NaN
dtype: float64

In [17]:
(s - s2)/s2*100

대구         NaN
대전         NaN
부산    0.877517
서울    1.019959
인천    7.433698
dtype: float64

In [18]:
s['부산'] = 4000000

In [19]:
s

도시
서울    9904312
부산    4000000
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [20]:
s['광주'] = 2000000
s

도시
서울    9904312
부산    4000000
인천    2890451
대구    2466052
광주    2000000
Name: 인구, dtype: int64

In [21]:
del s['서울']
s

도시
부산    4000000
인천    2890451
대구    2466052
광주    2000000
Name: 인구, dtype: int64

In [22]:
data = {
    '2015':[9904312, 3448737, 2890451, 2466052],
    '2010':[9631482, 3393191, 2632035, 2431774]
}
data

{'2015': [9904312, 3448737, 2890451, 2466052],
 '2010': [9631482, 3393191, 2632035, 2431774]}

In [23]:
df = pd.DataFrame(data)
df

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035
3  2466052  2431774

In [24]:
df.index = ['seoul', 'busan', 'incheon', 'daegu']
df

            2015     2010
seoul    9904312  9631482
busan    3448737  3393191
incheon  2890451  2632035
daegu    2466052  2431774

In [25]:
data = [
    [9904312, 3448737, 2890451, 2466052],
    [9631482, 3393191, 2632035, 2431774]
]
ind = ['2015', '2010']
col = ['seoul', 'busan', 'incheon', 'daegu']

In [26]:
df2 = pd.DataFrame(data, index=ind, columns=col)
df2

        seoul    busan  incheon    daegu
2015  9904312  3448737  2890451  2466052
2010  9631482  3393191  2632035  2431774

In [27]:
df2.T

            2015     2010
seoul    9904312  9631482
busan    3448737  3393191
incheon  2890451  2632035
daegu    2466052  2431774

In [28]:
data = [
    [175.3, 180.2, 178.6],
    [66.2, 78.9, 55.1],
    [27.0, 49.0, 35.0]
]
index = ['height', 'weight', 'age']
col = ['Hong', 'Kim', 'Lim']

In [29]:
df3 = pd.DataFrame(data, index=index, columns=col)
df3

         Hong    Kim    Lim
height  175.3  180.2  178.6
weight   66.2   78.9   55.1
age      27.0   49.0   35.0

In [36]:
df['2005'] = [6545584, 6549854, 4561215, 2658466]

In [37]:
df

            2015     2010     2005
seoul    9904312  9631482  6545584
busan    3448737  3393191  6549854
incheon  2890451  2632035  4561215
daegu    2466052  2431774  2658466

In [38]:
df.loc['seoul' : 'busan', '2015' : '2010']

          2015     2010
seoul  9904312  9631482
busan  3448737  3393191

In [40]:
df.iloc[3]

2015    2466052
2010    2431774
2005    2658466
Name: daegu, dtype: int64

In [41]:
df.iloc[2:3, 0:1]

            2015
incheon  2890451

In [42]:
df

            2015     2010     2005
seoul    9904312  9631482  6545584
busan    3448737  3393191  6549854
incheon  2890451  2632035  4561215
daegu    2466052  2431774  2658466

In [44]:
df['2010'] >= 2500000

seoul       True
busan       True
incheon     True
daegu      False
Name: 2010, dtype: bool

In [45]:
df[df['2010'] >= 2500000]

            2015     2010     2005
seoul    9904312  9631482  6545584
busan    3448737  3393191  6549854
incheon  2890451  2632035  4561215